БухЭксп/Catalogs/CW_Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПеревозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заявки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СформироватьЗаполнитьЗаказПоЗаявке(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ОперативныйМенеджер = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойОперативныйМенеджер");

	Если ПараметрыПроцедуры.СоздатьЗаказ Тогда
		НовыйЗаказ = Справочники.CW_Заказы.СоздатьЭлемент();
		
		НовыйЗаказ.ДополнительныеСвойства.Вставить("ЗаполнитьПараметрыПозаявке", 	Истина);
		НовыйЗаказ.ДополнительныеСвойства.Вставить("ИзЗаявки", 						Истина);

		НовыйЗаказ.Заполнить(ПараметрыПроцедуры.Заявка); 
		
		НовыйЗаказ.ТипПеревозки  = ПараметрыПроцедуры.ТипПеревозки;	
		НовыйЗаказ.Ответственный = ПараметрыСеанса.ТекущийПользователь; 
		
		НовыйЗаказ.ОперативныйМенеджер 	= ОперативныйМенеджер;
		
		НовыйЗаказ.Записать();
		
		//Запишем стутасы
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйЗаказ.Ссылка);
		
		CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
		CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
		//Запишем стутасы

		ТекущийЗаказ = НовыйЗаказ.Ссылка;
	Иначе
		ТекущийЗаказ = ПараметрыПроцедуры.Заказ; 
	КонецЕсли;
	
	Если ПараметрыПроцедуры.РежимВводаКоличества <> 2 Тогда 
		
		мГрузоперевозки = Новый Массив;
		
		Для СчетчикГрузоперевозок = 1 По ПараметрыПроцедуры.Количество Цикл
			
			НоваяГП = Справочники.CW_Грузоперевозки.СоздатьЭлемент();
			
			Если ПараметрыПроцедуры.ВводПоПредставлениям Тогда
				
				ПредставлениеГрузоперевозки = ПараметрыПроцедуры.ПредставленияГрузоперевозок[СчетчикГрузоперевозок-1];
				//Заполняем представления грузоперевозок
				НоваяГП.CW_Представление	= ПредставлениеГрузоперевозки;
				НоваяГП.Наименование 		= ПредставлениеГрузоперевозки;
				
			КонецЕсли;
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Заявка",				ПараметрыПроцедуры.Заявка);
			ПараметрыЗаполнения.Вставить("Заказ", 				ТекущийЗаказ);
			ПараметрыЗаполнения.Вставить("ТипПеревозки", 		ПараметрыПроцедуры.ТипПеревозки);
			ПараметрыЗаполнения.Вставить("ЗаполнитьПараметры", 	Истина); 
			
			Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
				ПараметрыЗаполнения.Вставить("МенеджерПродаж",		ТекущийЗаказ.МенеджерПродаж);
				ПараметрыЗаполнения.Вставить("ОперативныйМенеджер",	ТекущийЗаказ.ОперативныйМенеджер);
			Иначе
				ПараметрыЗаполнения.Вставить("ОперативныйМенеджер",	ОперативныйМенеджер);
			КонецЕсли;
			
			НоваяГП.Заполнить(ПараметрыЗаполнения);
			
			НоваяГП.Заказ = ТекущийЗаказ;  
			
			// заполним типоразмер, если в заказе есть ссылка на заявку
			Если ЗначениеЗаполнено(ТекущийЗаказ.Заявка) Тогда
				НоваяГП.Типоразмер = ТекущийЗаказ.Заявка.Типоразмер; 	
			КонецЕсли;
			
			НоваяГП.Записать(); 
			
			мГрузоперевозки.Добавить(НоваяГП.Ссылка);
			
			//Запишем стутасы
			МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НоваяГП.Ссылка);
			
			CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
			CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
			//Запишем стутасы
			
		КонецЦикла; 
		
		Если ПараметрыПроцедуры.КопироватьБюджет Тогда 
			
			ПараметрыПроцедуры.Вставить("Грузоперевозки", мГрузоперевозки); 
			ПараметрыПроцедуры.Вставить("УдалитьСуществующиеСтатьиБюджета", Ложь);
	
			CW_Бюджетирование.ЗаполнитьБюджетыПоЗаявке(ПараметрыПроцедуры);	
		КонецЕсли;
		
	Конецесли;
	
	ПоместитьВоВременноеХранилище(ТекущийЗаказ, АдресРезультата);
	
КонецФункции 

Функция ЗаполнитьБюджетыПоЗаявке(ПараметрыПроцедуры) 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец КАК Владелец,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&мГрузоперевозки)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета";
	
	Запрос.УстановитьПараметр("мГрузоперевозки", 	ПараметрыПроцедуры.Грузоперевозки);
	Запрос.УстановитьПараметр("ВерсияБюджета", 		ПараметрыПроцедуры.ВерсияБюджетаГрузоперевозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСтатьиБюджетаГрузоперевозок = РезультатЗапроса.Выбрать();
	
	Если ПараметрыПроцедуры.РежимКопированияБюджета = 0 Тогда
		Пока ВыборкаСтатьиБюджетаГрузоперевозок.Следующий() Цикл
			СтатьяОбъект = ВыборкаСтатьиБюджетаГрузоперевозок.Ссылка.ПолучитьОбъект();
			Попытка
				СтатьяОбъект.Удалить();
			Исключение
				СтатьяОбъект.УстановитьПометкуУдаления(Истина);
			КонецПопытки;
		КонецЦикла;
		
		ВыборкаСтатьиБюджетаГрузоперевозок = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокВариантовБюджета", ПараметрыПроцедуры.СписокВариантовБюджета); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(CW_ПлановыеСтатьиЗатратИДоходов.Ссылка) КАК Ссылка,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокРаспределенияСуммы КАК ПорядокРаспределенияСуммы,
	|	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.Сумма) КАК Сумма,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего) КАК СуммаВсего,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб) КАК СуммаВсегоРуб,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДС) КАК СуммаНДС,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДСРуб) КАК СуммаНДСРуб,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаРуб) КАК СуммаРуб,
	|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_КопируемыеСтатьиБюджета
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&СписокВариантовБюджета)
	|	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияДоходов,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент,
	|	CW_ПлановыеСтатьиЗатратИДоходов.Организация,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокРаспределенияСуммы,
	|	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС";
	
	Запрос.Выполнить();
	
	//На каждую грузоперевозку
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_КопируемыеСтатьиБюджета.Ссылка КАК Ссылка,
	|	ВТ_КопируемыеСтатьиБюджета.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	|	ВТ_КопируемыеСтатьиБюджета.Организация КАК Организация,
	|	ВТ_КопируемыеСтатьиБюджета.Контрагент КАК Контрагент,
	|	ВТ_КопируемыеСтатьиБюджета.Номенклатура КАК Номенклатура,
	|	ВТ_КопируемыеСтатьиБюджета.Валюта КАК Валюта,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов,
	|	ВТ_КопируемыеСтатьиБюджета.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.Сумма КАК Сумма,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсего КАК СуммаВсего,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсегоРуб КАК СуммаВсегоРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДС КАК СуммаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаРуб КАК СуммаРуб,
	|	ВТ_КопируемыеСтатьиБюджета.Количество КАК Количество
	|ИЗ
	|	ВТ_КопируемыеСтатьиБюджета КАК ВТ_КопируемыеСтатьиБюджета
	|ГДЕ
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокРаспределенияСуммы = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СкопироватьСтатьюПоГрузоперевозкам(
		Выборка, 
		ПараметрыПроцедуры.Грузоперевозки, 
		ПараметрыПроцедуры.ВерсияБюджетаГрузоперевозки, 
		ПараметрыПроцедуры.РежимКопированияБюджета, 
		ВыборкаСтатьиБюджетаГрузоперевозок);
	КонецЦикла;
	//---На каждую грузоперевозку  
	
	//ПараметрыПроцедуры.РаспределятьНаГрузоперевозки,
	
	//На первую грузоперевозку
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_КопируемыеСтатьиБюджета.Ссылка КАК Ссылка,
	|	ВТ_КопируемыеСтатьиБюджета.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	|	ВТ_КопируемыеСтатьиБюджета.Организация КАК Организация,
	|	ВТ_КопируемыеСтатьиБюджета.Контрагент КАК Контрагент,
	|	ВТ_КопируемыеСтатьиБюджета.Номенклатура КАК Номенклатура,
	|	ВТ_КопируемыеСтатьиБюджета.Валюта КАК Валюта,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов,
	|	ВТ_КопируемыеСтатьиБюджета.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.Сумма КАК Сумма,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсего КАК СуммаВсего,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсегоРуб КАК СуммаВсегоРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДС КАК СуммаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаРуб КАК СуммаРуб,
	|	ВТ_КопируемыеСтатьиБюджета.Количество КАК Количество
	|ИЗ
	|	ВТ_КопируемыеСтатьиБюджета КАК ВТ_КопируемыеСтатьиБюджета
	|ГДЕ
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокРаспределенияСуммы = 1";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	мГрузоперевозки = ПараметрыПроцедуры.Грузоперевозки[0];
	
	Пока Выборка.Следующий() Цикл
		СкопироватьСтатьюПоГрузоперевозкам(
		Выборка, 
		мГрузоперевозки, 
		ПараметрыПроцедуры.ВерсияБюджетаГрузоперевозки, 
		ПараметрыПроцедуры.РежимКопированияБюджета, 
		ВыборкаСтатьиБюджетаГрузоперевозок);
	КонецЦикла;
	//---На первую грузоперевозку 	
	
	//Пропорционально на все
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_КопируемыеСтатьиБюджета.Ссылка КАК Ссылка,
	|	ВТ_КопируемыеСтатьиБюджета.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	|	ВТ_КопируемыеСтатьиБюджета.Организация КАК Организация,
	|	ВТ_КопируемыеСтатьиБюджета.Контрагент КАК Контрагент,
	|	ВТ_КопируемыеСтатьиБюджета.Номенклатура КАК Номенклатура,
	|	ВТ_КопируемыеСтатьиБюджета.Валюта КАК Валюта,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов,
	|	ВТ_КопируемыеСтатьиБюджета.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.Сумма КАК Сумма,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсего КАК СуммаВсего,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаВсегоРуб КАК СуммаВсегоРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДС КАК СуммаНДС,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ВТ_КопируемыеСтатьиБюджета.СуммаРуб КАК СуммаРуб,
	|	ВТ_КопируемыеСтатьиБюджета.Количество КАК Количество
	|ИЗ
	|	ВТ_КопируемыеСтатьиБюджета КАК ВТ_КопируемыеСтатьиБюджета
	|ГДЕ
	|	ВТ_КопируемыеСтатьиБюджета.ПорядокРаспределенияСуммы = 2";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СкопироватьСтатьюПоГрузоперевозкамПропорционально(
		Выборка, 
		ПараметрыПроцедуры.Грузоперевозки, 
		ПараметрыПроцедуры.ВерсияБюджетаГрузоперевозки, 
		ПараметрыПроцедуры.РежимКопированияБюджета, 
		ВыборкаСтатьиБюджетаГрузоперевозок);
	КонецЦикла;
	//---Пропорционально на все

КонецФункции

Процедура СкопироватьСтатьюПоГрузоперевозкам(Выборка, мГрузоперевозки, ВерсияБюджета, РежимКопированияБюджета, ВыборкаСтатьиБюджета)
	
	Если ВыборкаСтатьиБюджета <> Неопределено Тогда
		ПараметрыОтбора = Новый Структура("ВидСтатьиПланирования,Контрагент,Номенклатура,Валюта,Организация,ПорядокОтраженияРасходов,ПорядокОтраженияДоходов");
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
		ПараметрыОтбора.Вставить("ВерсияБюджета", ВерсияБюджета);
	КонецЕсли;
	
	Для Каждого Грузоперевозка из мГрузоперевозки Цикл 
		Если ВыборкаСтатьиБюджета <> Неопределено Тогда
			ПараметрыОтбора.Вставить("Владелец", Грузоперевозка);
			
			ВыборкаСтатьиБюджета.Сбросить();
			Если ВыборкаСтатьиБюджета.НайтиСледующий(ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтатья = Выборка.Ссылка.Скопировать();
		НоваяСтатья.Владелец 		= Грузоперевозка; 
		НоваяСтатья.ВерсияБюджета 	= ВерсияБюджета;
		
		ЗаполнитьЗначенияСвойств(НоваяСтатья, Выборка,"Сумма,СуммаВсего,СуммаНДС,Количество,СуммаВсегоРуб,СуммаНДСРуб,СуммаРуб,СтавкаНДС");
		
		НоваяСтатья.Цена 	= Выборка.Сумма / ?(Выборка.Количество=0, 1, Выборка.Количество);      
		НоваяСтатья.ЦенаРуб = Выборка.СуммаРуб / ?(Выборка.Количество=0, 1, Выборка.Количество);      
		
		НоваяСтатья.ТипКурсаВалюты = 1;      
		Если Выборка.СуммаВсего <> 0 Тогда  
			НоваяСтатья.Курс = Окр(Выборка.СуммаВсегоРуб/Выборка.СуммаВсего, 4);
		Иначе
			НоваяСтатья.Курс = 1;	
		КонецЕсли;
		
		НоваяСтатья.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура СкопироватьСтатьюПоГрузоперевозкамПропорционально(Выборка, мГрузоперевозки, ВерсияБюджета, РежимКопированияБюджета, ВыборкаСтатьиБюджета)
	
	Если ВыборкаСтатьиБюджета <> Неопределено Тогда
		ПараметрыОтбора = Новый Структура("ВидСтатьиПланирования,Контрагент,Номенклатура,Валюта,Организация,ПорядокОтраженияРасходов,ПорядокОтраженияДоходов");
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
		ПараметрыОтбора.Вставить("ВерсияБюджета", ВерсияБюджета);
	КонецЕсли;
	
	//Кэшируем суммы по статье
	Сумма 		= Выборка.Сумма;
	СуммаНДС  	= Выборка.СуммаНДС;
	СуммаВсего  = Выборка.СуммаВсего;
	
	СуммаРуб		= Выборка.СуммаРуб;
	СуммаНДСРуб  	= Выборка.СуммаНДСРуб;
	СуммаВсегоРуб  	= Выборка.СуммаВсегоРуб;   
	//---Кэшируем суммы по статье
	
	Курс = 1;
	Если Выборка.СуммаВсего <> 0 Тогда
		Курс = Окр(Выборка.СуммаВсегоРуб/Выборка.СуммаВсего, 4);
	КонецЕсли;

	ЗначениеСтавки = CW_Финансы.ПолучитьСтавкуНДС(Выборка.СтавкаНДС)/100;
	
	СуммаРаспределено 		= 0;
	СуммаНДСРаспределено 	= 0;
	СуммаВсегоРаспределено 	= 0;

	СуммаРубРаспределено 		= 0;
	СуммаНДСРубРаспределено 	= 0;
	СуммаВсегоРубРаспределено 	= 0;
	
	Для индекс = 0 по мГрузоперевозки.ВГраница() Цикл
		
		Грузоперевозка = мГрузоперевозки[индекс];
		
		Если ВыборкаСтатьиБюджета <> Неопределено Тогда
			ПараметрыОтбора.Вставить("Владелец", Грузоперевозка);
			
			ВыборкаСтатьиБюджета.Сбросить();
			Если ВыборкаСтатьиБюджета.НайтиСледующий(ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтатья = Выборка.Ссылка.Скопировать();
		НоваяСтатья.Владелец 		= Грузоперевозка; 
		НоваяСтатья.ВерсияБюджета 	= ВерсияБюджета; 
		
		НоваяСтатья.Количество 		= Выборка.Количество;  
		НоваяСтатья.СтавкаНДС 		= Выборка.СтавкаНДС;  
		
		НоваяСтатья.СуммаВсего	= Окр(Выборка.СуммаВсего / мГрузоперевозки.Количество(), 2); 
		НоваяСтатья.СуммаНДС 	= НоваяСтатья.СуммаВсего * ЗначениеСтавки / (1+ЗначениеСтавки);  
		НоваяСтатья.Сумма 		= НоваяСтатья.СуммаВсего - НоваяСтатья.СуммаНДС;
		
		НоваяСтатья.СуммаВсегоРуб	= НоваяСтатья.СуммаВсего * Курс; 
		НоваяСтатья.СуммаНДСРуб 	= НоваяСтатья.СуммаНДСРуб * Курс;  
		НоваяСтатья.СуммаРуб 		= НоваяСтатья.СуммаРуб * Курс;
		
		НоваяСтатья.Цена 		= Выборка.Сумма		/ ?(Выборка.Количество=0, 1, Выборка.Количество);      
		НоваяСтатья.ЦенаРуб 	= Выборка.СуммаРуб 	/ ?(Выборка.Количество=0, 1, Выборка.Количество);      
		
		
		СуммаВсегоРаспределено 	= СуммаВсегоРаспределено + НоваяСтатья.СуммаВсего;
		СуммаНДСРаспределено 	= СуммаНДСРаспределено + НоваяСтатья.СуммаНДС;
		СуммаРаспределено 		= СуммаРаспределено + НоваяСтатья.Сумма;    
		
		СуммаВсегоРубРаспределено 	= СуммаВсегоРубРаспределено + НоваяСтатья.СуммаВсегоРуб;
		СуммаНДСРубРаспределено 	= СуммаНДСРубРаспределено + НоваяСтатья.СуммаНДСРуб;
		СуммаРубРаспределено 		= СуммаРубРаспределено + НоваяСтатья.СуммаРуб;  
		
		Если индекс = мГрузоперевозки.Количество() - 1 Тогда
			//Последняя грузоперевозка   
			НоваяСтатья.Сумма 		= НоваяСтатья.Сумма + (Сумма - СуммаРаспределено);
			НоваяСтатья.СуммаНДС 	= НоваяСтатья.СуммаНДС + (СуммаНДС - СуммаНДСРаспределено);
			НоваяСтатья.СуммаВсего 	= НоваяСтатья.СуммаВсего + (СуммаВсего - СуммаВсегоРаспределено);
			
			НоваяСтатья.СуммаРуб 		= НоваяСтатья.СуммаРуб + (СуммаРуб - СуммаРубРаспределено);
			НоваяСтатья.СуммаНДСРуб 	= НоваяСтатья.СуммаНДСРуб + (СуммаНДСРуб - СуммаНДСРубРаспределено);
			НоваяСтатья.СуммаВсегоРуб 	= НоваяСтатья.СуммаВсегоРуб + (СуммаВсегоРуб - СуммаВсегоРубРаспределено);
			
		КонецЕсли;
		
		НоваяСтатья.Записать();  
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьКоличествоГрузоперевозокПоЗаявке(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_Грузоперевозки.Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Заявка = &Заявка";
	Запрос.УстановитьПараметр("Заявка", Заявка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции




Функция ЗаполнитьНастройкиКолонок(ТипПеревозки=Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка", "Грузоперевозка", Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки"));
	Результат.Добавить(Структура);
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Грузоперевозки.Реквизиты Цикл
		Если Найти(Реквизит.Имя, "удалить") = 0 Тогда
			Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка." + Реквизит.Имя, Реквизит.Синоним, Реквизит.Тип);
			Результат.Добавить(Структура);
		КонецЕсли;	
	КонецЦикла;	
	
	ВыборкаПараметров = ПолучитьДоступныеПараметры(ТипПеревозки);
	Пока ВыборкаПараметров.Следующий() Цикл
		Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка.[" + ВыборкаПараметров.Идентификатор + "]", "Грузоперевозка." + ВыборкаПараметров.Идентификатор, ВыборкаПараметров.ТипЗначения);
		Результат.Добавить(Структура);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьДоступныеПараметры(ТипПеревозки = Неопределено)
	
	МассивПараметров = Неопределено;
	Если ТипПеревозки <> Неопределено Тогда
		МассивПараметров = ТипПеревозки.ПараметрыГрузоперевозки.Выгрузить().ВыгрузитьКолонку("Параметр");
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());			
	Если ГруппаПользователя.ПолныеПрава Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	ВЫБОР
	               |		КОГДА &Группа = ЗНАЧЕНИЕ(Справочник.CW_ГруппыПользователей.Администраторы)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |	КОНЕЦ КАК Просмотр
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &УказанТипПеревозки
	               |				ТОГДА CW_ПараметрыГрузоперевозок.Ссылка В (&МассивПараметров)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Параметр КАК Параметр,
	               |	ВТ.Идентификатор КАК Идентификатор,
	               |	ВТ.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Просмотр = ИСТИНА";
		
	Запрос.УстановитьПараметр("Группа"				, ГруппаПользователя);
	Запрос.УстановитьПараметр("УказанТипПеревозки"	, ТипПеревозки <> Неопределено);
	Запрос.УстановитьПараметр("МассивПараметров"	, МассивПараметров);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции	

Функция ПолучитьМассивГрузоперевозокЗаявки(Знач МассивЗаявок) Экспорт

	Если ТипЗнч(МассивЗаявок) = Тип("СправочникСсылка.CW_Заявки") Тогда
		МассивЗаявок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивЗаявок);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Заявка В (&МассивЗаявок)";
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМассивЗаказовЗаявки(Знач МассивЗаявок) Экспорт

	Если ТипЗнч(МассивЗаявок) = Тип("СправочникСсылка.CW_Заявки") Тогда
		МассивЗаявок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивЗаявок);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Заказы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |ГДЕ
	               |	CW_Заказы.Заявка В(&МассивЗаявок)";
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьГрузоперевозки(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого ГрузоперевозкаСсылка из ПараметрыПроцедуры.МассивГрузоперевозок Цикл
		ГрузоперевозкаОбъект = ГрузоперевозкаСсылка.ПолучитьОбъект();
		ГрузоперевозкаОбъект.Заявка = ПараметрыПроцедуры.Заявка;
		ГрузоперевозкаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры 

//Шаблоны стандартных писем  
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт  
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Заказ";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заявка]", 				"Заявка",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаЗаявки]", 			"Дата заявки", 			2); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ТипПеревозки]", 		"Тип перевозки",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Контрагент]", 			"Контрагент",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[МенеджерПродаж]", 		"Менеджер продаж",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Маршрут]", 			"Маршрут",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Груз]", 				"Груз",					4);  			
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Типоразмер]", 			"Груз",					4);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокГрузоперевозок]",	"Список грузоперевозок",9); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокЗаказов]",			"Список заказов",9); 
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	
КонецПроцедуры    

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры

Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат.Вставить("[Заявка]", 				"Источник");
	Результат.Вставить("[ДатаЗаявки]", 			"Источник.ДатаОбращения");
	Результат.Вставить("[Контрагент]", 			"Источник.Контрагент");
	Результат.Вставить("[ТипПеревозки]", 		"Источник.ТипПеревозки");
	Результат.Вставить("[МенеджерПродаж]", 		"Источник.МенеджерПродаж");
	Результат.Вставить("[Маршрут]",				"Источник.Маршрут");
	Результат.Вставить("[Груз]",				"Источник.Груз");
	Результат.Вставить("[Типоразмер]", 			"Источник.Типоразмер");
	Результат.Вставить("[СписокГрузоперевозок]","МенеджерОбъектаШаблона.ПолучитьСписокГрузоперевозок(Источник)");
	Результат.Вставить("[СписокЗаказов]",		"МенеджерОбъектаШаблона.ПолучитьСписокЗаказов(Источник)");

	Результат.Вставить("[ФИООтправителя]", 		"CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.ДатаОбращения)");
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры  

Функция ПолучитьСписокГрузоперевозок(Источник) Экспорт
	
	Массив = ПолучитьМассивГрузоперевозокЗаявки(Источник);
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции   

Функция ПолучитьСписокЗаказов(Источник) Экспорт
	
	Массив = ПолучитьМассивЗаказовЗаявки(Источник);
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт
	
	Параметр = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если Параметр = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиЗаявок.Значение КАК Значение,
	               |	CW_ХарактеристикиЗаявок.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиЗаявок.ЗначениеФакт КАК ЗначениеФакт
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиЗаявок КАК CW_ХарактеристикиЗаявок
	               |ГДЕ
	               |	CW_ХарактеристикиЗаявок.Заявка = &Заявка
	               |	И CW_ХарактеристикиЗаявок.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Заявка",		Источник);
	Запрос.УстановитьПараметр("Параметр",	Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
	КонецЕсли;
	
	Возврат ЗначениеПараметра;

КонецФункции
//---Шаблоны стандартных писем  



#КонецЕсли
